Revit 2024 API
FamilySizeTableErrorInfo Class
 Error information generated from the CSV file import of a FamilySizeTable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class FamilySizeTableErrorInfo : IDisposable
Visual Basic
Public Class FamilySizeTableErrorInfo _
	Implements IDisposable
Visual C++
public ref class FamilySizeTableErrorInfo : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FamilySizeTableErrorInfo
See Also
FamilySizeTableErrorInfo Members
Autodesk.Revit.DB Namespace